app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G') ORDER BY title
---
  def index
    if params[:ratings]
      @ratings = params[:ratings]
    end

    columns = {'title'=>'title', 'release_date'=>'release_date'}
    if columns.has_key?(params[:sortby])
      @sortby = columns[params[:sortby]]
      query = Movie.order(@sortby)
    else
      query = Movie
    end

    @movies = @ratings.nil? ? query.all : query.find_all_by_rating(@ratings.map { |r| r[0] })